from praktikum.ingredient_types import *


class Data:
    bun_name = ['Маффин', 'Бабка', 'Балабушки', 'Баннок', 'Бейгл', 'Бриошь',
                'Булочка', 'Бурекас', 'Крендель', 'Гаш', 'Далеба', 'Коврига',
                'Каравай', 'Краффин', 'Круассан', 'Пончик', 'Пита',
                'Рогалик', 'Сайка', 'Слойка']

    ingredients_name_fillings = ['Сыр', 'Колбаса', 'Лук', 'Бекон', 'Грибы',
                                 'Котлета', 'Стейк', 'Вкусная котлета', 'Салат']
    ingredients_name_sauces = ['Майонез', 'Песто', 'Цезарь', 'Кисло-сладкий',
                               'Сырный', 'Чесночный', 'Легкий', 'Сметанный']

    ingredients_num = [1, 2, 3, 4, 5]

    ingredient_type = [INGREDIENT_TYPE_SAUCE, INGREDIENT_TYPE_FILLING]